Do zadania załączone są 3 pliki CSV:
- Zamówienia 
- Cena bazowa
- Wysłane

W pliku zamówienia są informacje o zamówieniach klientów w wybranym okresie. W pliku znajdują się kolumny: 
- order_id – unikalny numer zamówienia
-	client_id – unikalny numer klienta
-	order_date – data złożenia zamówienia
-	kupon – informacja o tym, czy podczas składania zamówienia klient użył kuponu rabatowego obniżającego cenę bazową; wartość kuponu to procent zniżki od ceny bazowej

W pliku Cena bazowa znajdują się informacje o cenie bazowej każdego z produktów.
W pliku Wysłane znajdują się informacje o produktach wysłanych ostatecznie do każdego zamówienia. W jednym zamówieniu mogło się znaleźć więcej niż 1 produkt.

In [168]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

%matplotlib inline


from datetime import datetime
dateparse = lambda x: datetime.strptime(x, '%d.%m.%Y')
df_order = pd.read_csv('zamowienia.csv' , sep = ';' , parse_dates=['order_date'], date_parser=dateparse)

df_shipped= pd.read_csv('wyslane.csv' , sep = ';')

df_price=pd.read_csv('cena bazowa.csv' , sep = ';')

In [169]:
df_order.head()

   order_id  client_id order_date KUPON
0   1462414  523933015 2019-06-29   NaN
1   1538139  814107372 2019-08-15   NaN
2   1838871  713139458 2019-08-19   NaN
3   1896544  123641536 2019-05-05   15%
4   1943852  602252913 2019-07-30   NaN

In [170]:
df_order.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5023 entries, 0 to 5022
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    5023 non-null   int64
 1   client_id   5023 non-null   int64
 2   order_date  5023 non-null   datetime64[ns]
 3   KUPON       998 non-null    object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 157.1+ KB

# 1)	W jakim dniu roku klienci złożyli najwięcej zamówień?

odp. 14.08.2019

In [171]:
df_order.groupby('order_date')['order_id'].size().nlargest(1).reset_index(name='order_value')

  order_date  order_value
0 2019-08-14           41

# 2)	Ilu klientów skorzystało z kuponu rabatowego w trakcie zakupów?

odp. 998

In [172]:
df_order.groupby('client_id')['KUPON'].count().nlargest(10)

client_id
165795     1
554772     1
1653617    1
1802561    1
2442640    1
3255808    1
4117165    1
5069275    1
5461584    1
5927105    1
Name: KUPON, dtype: int64

In [173]:
df_order.groupby('client_id')['KUPON'].count().value_counts()

0    4002
1     998
Name: KUPON, dtype: int64

# 3)	Ilu klientów zrobiło w analizowanym okresie więcej niż jedno zamówienie?

odp. 2

In [199]:
df_order[(df_order['order_date']>= '2019-03-01') & (df_order['order_date']< '2019-04-01')].groupby('client_id')['order_id'].count().value_counts()

1    818
2      2
Name: order_id, dtype: int64

# 4) Który z produktów cieszył się największym powodzeniem? Ilu klientów kupiło go ze zniżką?

odp. Item 4355722, times 11

In [175]:
print(df_shipped)

       order_id  item_id_1  item_id_2  item_id_3
0     314631735    2655227  9051607.0        NaN
1     802224752    1984910  4286301.0        NaN
2     716057036    2669985  1052038.0        NaN
3     125731133    5966397        NaN        NaN
4      12070864    6788106  9643817.0        NaN
...         ...        ...        ...        ...
3662  552069972    4738768   684194.0  4169115.0
3663  408612183    8250741  1005647.0        NaN
3664  725171229     152614        NaN        NaN
3665   26224680    1971413        NaN        NaN
3666  824588700    5801454  2448933.0    52730.0

[3667 rows x 4 columns]

In [176]:
pd.concat([df_shipped.groupby('item_id_1')['order_id'].count(), 
           df_shipped.groupby('item_id_2')['order_id'].count(),
           df_shipped.groupby('item_id_3')['order_id'].count()]).groupby(level=0).sum().nlargest(10)

4355722.0    70
4652599.0    65
4550408.0    64
8368010.0    64
4118332.0    62
7086540.0    61
6612196.0    60
1554376.0    59
5966397.0    59
7015458.0    58
Name: order_id, dtype: int64

In [211]:
Max_Ordered_Item = 4355722
#Sort db so that in the columns item_id_1, item_id_2, item_id3 was id Max_Ordered_Item
df_with_MOI = pd.concat([df_shipped[df_shipped.item_id_1 == Max_Ordered_Item ],
                 df_shipped[df_shipped.item_id_2 == Max_Ordered_Item ],
                 df_shipped[df_shipped.item_id_3 == Max_Ordered_Item ]])       
df = df_order.merge(df_with_MOI)
df['KUPON'].notnull().sum()

11

# 5)	Który produkt był najczęściej kupowany ze zniżką?

odp. 1554376

In [210]:
df_Order_with_Shipped=df_order.merge(df_shipped)

df = df_Order_with_Shipped.loc[df_Order_with_Shipped['KUPON'].notnull()]

pd.concat([df.groupby('item_id_1')['order_id'].count(),
           df.groupby('item_id_2')['order_id'].count(),
           df.groupby('item_id_3')['order_id'].count()]).groupby(level=0).sum().nlargest(5)

1554376.0    19
9873648.0    17
552870.0     16
5007446.0    15
7642810.0    15
Name: order_id, dtype: int64

## 6) Jaka była końcowa wartość wszystkich zamówień w badanym okresie 2019-03-01 - 2019-04-01? 

odp. 126581.02

In [204]:
df_order_march = pd.merge(df_order[(df_order['order_date']>= '2019-03-01') & (df_order['order_date']< '2019-04-01')], df_shipped)
print(db_order_march)

     order_id  client_id order_date KUPON  item_id_1  item_id_2  item_id_3
0     8769369  292592441 2019-03-06   NaN    4355722        NaN        NaN
1   128571237  740864406 2019-03-16   20%    9780720  4355722.0        NaN
2   145853928  969665107 2019-03-21   NaN    6730346  4355722.0        NaN
3   320420558  859010463 2019-03-22   NaN    2050490  4355722.0        NaN
4   478959847  762202043 2019-03-29   NaN    4355722        NaN        NaN
5   560264746  570627821 2019-03-26   NaN    4355722        NaN        NaN
6   580807278  318053487 2019-03-11   NaN    9710873  4355722.0  7482912.0
7   668235922  700728646 2019-03-20   31%    4447776  4355722.0        NaN
8   692995685  916067289 2019-03-13   NaN    1866996  4355722.0        NaN
9   784693931  415669716 2019-03-28   NaN    9643817  4355722.0        NaN
10  872825246  549139706 2019-03-23   NaN    4355722        NaN        NaN
11  877092857  895450181 2019-03-06   25%    4355722        NaN        NaN
12  900771366  484193976 2019-03-11   NaN    1476431  4355722.0  9989669.0
13  954675281  561222335 2019-03-07   NaN    4355722        NaN        NaN
14  955609101  340588793 2019-03-31   NaN    9022757  4355722.0        NaN
15  974122825  962998181 2019-03-14   NaN    5894933  4355722.0        NaN

In [205]:
df_price.head()

   item_id  base_price
0  7447126         225
1  2696692         112
2  2883136         192
3  1984910         136
4  2242676         107

In [27]:
def df_column_switch(df, column1, column2):
    i = list(df.columns)
    a, b = i.index(column1), i.index(column2)
    i[b], i[a] = i[a], i[b]
    df = df[i]
    return df

In [215]:
def df_column_overwrite(df, column1, column2):
    c=column2
    return df_column_switch(df, column1, column2).rename(columns = { column2 : column1, column1 : c}).drop(columns = { c })

In [221]:
    df = pd.merge(df_order_march, price , how='left' , left_on='item_id_1' , right_on='item_id')
    df = df_column_overwrite(df ,'item_id_1' , 'base_price').drop(columns={'item_id'}) 
    
    df = pd.merge(df, price, how='left', left_on='item_id_2', right_on='item_id')
    df = df_column_overwrite(df,'item_id_2' , 'base_price').drop(columns={'item_id'})
    
    df = pd.merge(df, price, how='left', left_on='item_id_3', right_on='item_id')
    df = df_column_overwrite(df , 'item_id_3' , 'base_price').drop(columns={'item_id'})
    
    print(df)

      order_id  client_id order_date KUPON  item_id_1  item_id_2  item_id_3
0      4858291  608560296 2019-03-31   NaN        184        NaN        NaN
1      4932443  314452019 2019-03-31   20%        162        NaN        NaN
2      5045375  936096184 2019-03-08   NaN        145      189.0        NaN
3      8526443  322183155 2019-03-31   NaN        126        NaN        NaN
4      8769369  292592441 2019-03-06   NaN        178        NaN        NaN
..         ...        ...        ...   ...        ...        ...        ...
604  990151639  308874473 2019-03-03   NaN        123        NaN        NaN
605  990921887  760423445 2019-03-27   NaN        238        NaN        NaN
606  995877567  302977511 2019-03-16   NaN         68      132.0      208.0
607  995972294  836937939 2019-03-07   NaN        168      230.0      107.0
608  998934679  450085244 2019-03-28   NaN        136        NaN        NaN

[609 rows x 7 columns]

In [222]:
df['KUPON'] = df['KUPON'].str.rstrip('%').astype('float') / 100.0
print(df)

      order_id  client_id order_date  KUPON  item_id_1  item_id_2  item_id_3
0      4858291  608560296 2019-03-31    NaN        184        NaN        NaN
1      4932443  314452019 2019-03-31    0.2        162        NaN        NaN
2      5045375  936096184 2019-03-08    NaN        145      189.0        NaN
3      8526443  322183155 2019-03-31    NaN        126        NaN        NaN
4      8769369  292592441 2019-03-06    NaN        178        NaN        NaN
..         ...        ...        ...    ...        ...        ...        ...
604  990151639  308874473 2019-03-03    NaN        123        NaN        NaN
605  990921887  760423445 2019-03-27    NaN        238        NaN        NaN
606  995877567  302977511 2019-03-16    NaN         68      132.0      208.0
607  995972294  836937939 2019-03-07    NaN        168      230.0      107.0
608  998934679  450085244 2019-03-28    NaN        136        NaN        NaN

[609 rows x 7 columns]

In [223]:
df['suma'] = (df5['item_id_1'] + df.fillna(0)['item_id_2'] + df.fillna(0)['item_id_3']) * (1-df.fillna(0)['KUPON'])
print(df)

      order_id  client_id order_date  KUPON  item_id_1  item_id_2  item_id_3  \
0      4858291  608560296 2019-03-31    NaN        184        NaN        NaN
1      4932443  314452019 2019-03-31    0.2        162        NaN        NaN
2      5045375  936096184 2019-03-08    NaN        145      189.0        NaN
3      8526443  322183155 2019-03-31    NaN        126        NaN        NaN
4      8769369  292592441 2019-03-06    NaN        178        NaN        NaN
..         ...        ...        ...    ...        ...        ...        ...
604  990151639  308874473 2019-03-03    NaN        123        NaN        NaN
605  990921887  760423445 2019-03-27    NaN        238        NaN        NaN
606  995877567  302977511 2019-03-16    NaN         68      132.0      208.0
607  995972294  836937939 2019-03-07    NaN        168      230.0      107.0
608  998934679  450085244 2019-03-28    NaN        136        NaN        NaN

      suma
0    184.0
1    147.2
2    373.0
3    184.0
4    184.0
..     ...
604  168.0
605  122.0
606  462.0
607  489.0
608  238.0

[609 rows x 8 columns]

In [224]:
round(df['suma'].sum(),2)

126581.02